app/controllers/dashboard/surveys/polls_controller.rb

      def export_to_xlsx
        @statistic = PollStatistic::QuestionService.new(Poll.find(@str_prms[:poll_id])).call.to_xlsx
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]