app/controllers/dashboard/opinions_controller.rb

  def create
    opinion = Opinion.new(params[:opinion])
    opinion.user_id = @current_user[:id]
    authorize(Opinion)
    if opinion.save
---
INSERT INTO "opinions" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 32], ["created_at", "2017-07-28 07:41:50.945012"], ["updated_at", "2017-07-28 07:41:50.945012"]]