app/controllers/dashboard/public_stats_controller.rb

SELECT COUNT(*) FROM "social_logs" WHERE ("social_logs"."created_at" BETWEEN $1 AND $2)  [["created_at", "2017-06-28 00:00:00"], ["created_at", "2017-07-28 23:59:59"]]
---
    def all_connections
      all_connections = RedisCache.use key: 'public_all_connects', lifetime: TOTALS_CACHE_TIMEOUT do
        {
          total: SocialLog.all.count,
          last_month: SocialLog.where(created_at: DateTime.current.months_ago(1).beginning_of_day..DateTime.current.end_of_day).count,
          last_week: SocialLog.where(created_at: DateTime.current.weeks_ago(1).beginning_of_day..DateTime.current.end_of_day).count,
          time: @statistic_service.raw_time_pie(all_locations),
          social: @statistic_service.raw_social_pie(all_locations),
          age: @statistic_service.raw_age_pie(all_locations),
          new_old_users: @statistic_service.raw_new_old_users(all_locations)