app/controllers/dashboard/stats_controller.rb

SELECT COUNT("social_logs"."id") AS count_id, date_trunc('hour', created_at) AS date_trunc_hour_created_at FROM "social_logs" WHERE "social_logs"."location_id" = 26 AND ("social_logs"."created_at" BETWEEN $1 AND $2) GROUP BY date_trunc('hour', created_at) ORDER BY date_trunc_hour_created_at  [["created_at", "2017-07-21 00:00:00"], ["created_at", "2017-07-28 23:59:59"]]
---
    def authorizations
      render json:
      {
        data: SocialLog.raw_stats(@display_locations)
          .where(created_at: DateTime.current.weeks_ago(1).beginning_of_day..DateTime.current.end_of_day)
          .group("date_trunc('hour', created_at)")
          .order('date_trunc_hour_created_at')
                       .count(:id)
                       .to_a